{
    "home": "Home",
    "thanks": "Thanks",
    "nav":{
        "exp": "Experience",
        "form": "Education",
        "comp": "Skills",
        "int" : "Hobbies"
    },
   "exp":{
       "title": "Work Experience",
       "sopra":{
           "title": "Sopra Steria Aix-les-Milles",
           "date": "sept.2019 - Present",
           "fonction":"Junior web developer (work-study training)",
           "line1": "Development of management web applications.",
           "line2":"Standardization of codes and development of new reusable components.",
           "line3":"Technologies used: Elasticsearch, HTML, CSS, JS, Typescript, C#, Angular, .NET MVC"
       },
       "sncf":{
        "title": "SNCF Mobilité Technicentre d'Avignon",
        "date": "sept.2018 - sept. 2019",
        "fonction":"Apprentice engineer in methods office (work-study training)",
        "line1": "Set up of IT and material tools to make it easy for people to work in the maintenance center, and to increase productivity.",
        "line2":"VBA code to ease stock treatments and planification.",
        "line3":"Digital transformation of the management of maintenance sheet.",
        "line4":"Developed skills: VBA, Management, Plannification"
    }
   }, 
   "form":{
        "title": "Education",
        "centrale":{
            "title": "Centrale Marseille",
            "date": "sept.2017 - Present",
            "diploma":"General engineering diploma",
            "line1": "Options :",
            "line2":"2nd year : mathematics, IT, economy, mecanics, artificial intelligence and game theory.",
            "line3":"3rd year: Java, FullStack and mobile development, artificial intelligence, Internet of Things"
        },
        "prepa":{
            "title": "CPGE Lycée Thiers",
            "date": "sept.2015 - sept. 2017",
            "diploma":"Intensive courses to prepare entrance examination to best engineering schools",
            "text": "Specialty : mathematics and physics"
        },
        "lycee":{
            "title": "Lycée Saint Jospeh de la madeleine",
            "date": "juin 2015",
            "diploma":"Scientific baccalaureat",
            "text": "Options mathematics and music (piano)."
        }
    },
    "comp":{
        "html":{
            "title": "HTML, Javacsript, CSS",
            "theo":"Watch tutorial on TheNetNinja Youtube page, theorical and practical courses at Centrale Marseille",
            "pra":"Website development for personnal projects, school projects and during my work-study training at Sopra Steria"
        },
        "type":{
            "title": "Typescript",
            "theo":"",
            "pra":"Web development in Angular, using Typescript for personal projects. Development of a treeview component using only Typescript for Sopra Steria"        
        },
        "angu":{
            "title":"Angular",
            "theo":"Angular's tutorial 'Tour of heroes'. Several reading of articles and tutorials.",
            "pra":"Development for personal projects, school projects and development of a model for Sopra Steria. Development of my resume website and my project of searching your first job website."
        },
        "react":{
            "title":"React",
            "theo":"Reading on Packt website (React and react native, Beginning react, React Components)",
            "pra":""
        },
        "djan":{
            "title":"Django",
            "theo":"Tutorial Django.",
            "pra":"Web development with python and django pour the final project of my IT option in second year of Centrale Marseille."
        },
        "jq":{
            "title":"jQuery",
            "pra":"Using in several personal or profesional cases.",
            "theo":""
        },
        "node":{
            "title" :"Nodejs",
            "theo":"Watch tutorial on TheNetNinja Youtube page. Reading on Packt website (Node.js Essentials, Learn Node.js by building 6 projects, Node.js Web Development Fourth Edition) ",
            "pra":"Developments using Node.js, including my project to search your first job."
        },
        "csharp":{
            "title":"C#",
            "theo":"Several tutorials on OpenClassroom (Apprenez à developper en c#, Apprenez ASP.net MVC Programmez orienté objet avec c#, Apprenez à programmer en C# sur.Net, Creez votre première application connectée en c#/.net), sur Pluralsight (ASP.NET MVC 5 Fundamentals). Lecture du livre Pro ASP.NET MVC 5 de Adam Freeman.",
            "pra":"In my team at Sopra Steria, every application is developped using C# ASP.NET MVC"
        },
        "java":{
            "title":"Java",
            "theo":"Courses in Centrale Marseille for my options (Java and FullStack and mobile development).",
            "pra":""
        },
        "sql":{
            "title": "SQL",
            "pra":"Use for every application in my team at Sopra Steria (creating database, writing scripts and stocked procedures).",
            "theo":""
        },
        "elk":{
            "title":"Elasticsearch + Logstash + Kibana",
            "theo":"Reading the full documentation. Writing of a documentation for the install and use of the stack.",
            "pra":"My first mission at Sopra Steria consisted in testing and setting up these softwares in order to use them in our applications. I made an in-depth work of groks, in order to treat log files. Finally I built an Angular app using Elasticsearch as a service. "
        },
        "ia":{
            "title":"Intelligence artificielle et machine learning",
            "theo":"Courses at Centrale Marseille during my second and third years",
            "pra":"Solving game problems (chess and awale)."
        },
        "python":{
            "title":"Python",
            "pra": "",
            "theo" : "Several courses and works in several fields during my studies in Classes préparatoires and Centrale Marseille."
        },
        "matlab":{
            "title": "Matlab",
            "theo":"",
            "pra":"Courses at Centrale Marseille, using in several subject, including a final project in Waves and signal."
        },
        "agile":{
            "title":"Développement agile",
            "theo":"Courses at Centrale Marseille. Studying of the agile manifesto, and presentation to my collegues at Sopra Steria.",
            "pra":""
        },
        "projet":{
            "title": "Gestion de projet",
            "theo":"MOOC. Implementation in my teams at SNCF, Sopra Steria or during school projects.",
            "pra":""
        },
        "vba":{
            "title": "VBA",
            "theo":"Reading tutorials at OpenClassroom. ", 
            "pra": "Code for SNCF to optimize planning and storage processes ."
        },
        "adob":{
            "title":"Adobe Illustrator, Adobe Photoshop",
            "pra":"Making banners, posters, logo for my associations at Centrale Marseille.",
            "theo":""
        },
        "fr":{
            "title":"French",
            "pra":"native",
            "theo":""
        },
        "en":{
            "title":"English",
            "pra":"Advanced, TOEIC 960",
            "theo":""
        },
        "es":{
            "title":"Spanish",
            "pra":"Intermediate",
            "theo":""
        }
    },
    "proj":{
        "title":"Projets",
        "cv":{
            "title":"Dynamic Resume Website",
            "desc":"My personal website, where it is possible to find my resume in a dynamic version, or a more traditionnal one. It is developped with Angular and deployed in a server provided by my school Centrale Marseille."
        },
        "job":{
            "title":"Website to find your first job",
            "desc":"Website that helps you find the company of your dream for a first job, an internship or work-study training according to several criterias. We want to best match offers with candidates. The site is coded with Angular and NodeJs."
        },
        "treeview":{
            "title":"Reusable treeview component.",
            "desc":"For my work in Sopra Steria, I developed a treeview component using Typescript. The aim was to build a treeview completely reusable, easy to modify, easy to integrate. It can fit easily any context."
        },
        "elastic":{
            "title":"ElasticStack documentation",
            "desc":"Work on the writing of a complete documentation of Elasticsearch. I made my own documentation, thanks to experiments, for the install of Elasticsearch, Logstash and Kibana on Windows and Linux. Then I read he full documentation of Elasticsearch and made a sum up, adding some relevant informations. Finally, I build an Angular project to use Elasticsearch as a service. It is available on Github."
        }
    },
    "int":{
        "hover": "hover to see more",
        "title": "Hobbies",
        "photo":"Photography film and reflex",
        "music": "Music - piano and ukulele",
        "sport": "Sport - running, fitness",
        "cook": "Cooking",
        "asso": "Volunteering",
        "film":"Movies and TV shows",
        "detail":{
            "title":"My volunteering in details",
            "cheer":"The association aims at helping people suffuring of cancer, and their family. They organize public events to raise money, or private events to distract or help people with a specific project. I was the secretary of the association in 2018, but also the project manager. During my mandate I took part in the organization of the association events, like the annual race 'Course contre le cancer', where for each runned kilometer, 1€ is gived to an association, or the 'Operation Cupidon', where we sold flowers to raise money. Also I organized two events: a sailing trip and ULM flights for patient in remission.",
            "inter":"I was part of the organization of a sport event, gathering students from every Centrale school (Paris, Lille, Nantes, Lyon, Marseille). It was a competition during an entire week end, in five ball sport. ",
            "pho":"Echanges Phocéen is an association where members tutor young students from priority education territories or in a situation of disability, to promote equal opportunities. I was in charge of middle school students."
        }
    },
    "cv":{
        "cv-button": "My resume",
        "cv-text": "To print a simplified version of my resume",
        "aboutme":{
            "title":"About me",
            "text":"I am a hardworking, dynamic and ambitious individual with a great passion for IT. I am currently in my third and last year of studying general Engineering."
        },
        "project":{
            "title": "Projects",
            "resume":{
                "title":"Dynamic Resume Website",
                "text":"My personal website, where it is possible to find my resume in a dynamic version, or a more traditionnal one."
            },
            "job":{
                "title":"Website to find your first job",
                "text":"Website that helps you find the company of your dream for a first job, an internship  or work-study training according to several criterias."
            }
        },
        "print":"Print Resume",
        "load":"Download Resume"
    },
    "skills":{
        "title":"Skills"
    },
    "lang":{
        "title":"Languages",
        "fr":"French - native",
        "en":"English - advances (TOEIC : 960)",
        "es":"Spanish - intermediate"
    } 
}