{
    "home": "Accueil",
    "thanks": "Merci pour votre visite",
    "nav":{
        "exp": "Expérience",
        "form": "Formation",
        "comp": "Compétences",
        "int" : "Centres d'intérêt"
    },
   "exp":{
       "title": "Expériences professionnelles",
       "sopra":{
           "title": "Sopra Steria, Aix-les-Milles",
           "date": "sept.2019 - Présent",
           "fonction":"Développeur web junior en alternance",
           "line1": "Etude de nouvelles solutions pour le traitement automatique des fichiers de log.",
           "line2":"Développement d'applications de gestion dans le pôle .NET de l'agence.Standardisation de codes et dévelopement de nouveaux composants réutilisables.",
           "line3":"Technologies utilisées : Elasticsearch, HTML, CSS, JS, Typescript, C#, Angular, .NET MVC"
       },
       "sncf":{
        "title": "SNCF Mobilité, Technicentre d'Avignon",
        "date": "sept.2018 - sept. 2019",
        "fonction":"Apprenti ingénieur méthode",
        "line1": "Mise en place d'outils informatiques et matériels afin de faciliter le travail des autres employés du centre de maintenance, et de le rendre plus productif.",
        "line2":"Code VBA pour faciliter le traitement des stocks et la plannification.",
        "line3":"Digitalisation du traitement des fiches de maintenance.",
        "line4":"Compétences développées: VBA, Management, Plannification"
    }
   }, 
   "form":{
        "title": "Formation",
        "centrale":{
            "title": "Centrale Marseille",
            "date": "sept.2017 - Présent",
            "diploma":"Diplôme d'ingénieur généraliste",
            "line1": "Options :",
            "line2":"2ème année : mathématiques, informatique, economie, mécanique, intelligence artificielle et théorie des jeux.",
            "line3":"3ème année: Java, développement fullstack et mobile, intelligence artificielle, Internet of Things"
        },
        "prepa":{
            "title": "CPGE Lycée Thiers",
            "date": "sept.2015 - sept. 2017",
            "diploma":"Classe préparatoire aux grandes écoles",
            "text": "Filière MPSI puis MP*."
        },
        "lycee":{
            "title": "Lycée Saint Jospeh de la madeleine",
            "date": "juin 2015",
            "diploma":"Baccalauréat Scientifique",
            "text": "Spécialité mathématiques et option musique (piano) en candidat libre."
        }
    },
    "comp":{
        "html":{
            "title": "HTML, Javacsript, CSS",
            "theo":"Visionnage de tutoriels sur la page Youtube de TheNetNinja, Cours théoriques et travaux pratiques à Centrale Marseille",
            "pra":"Développement de sites web pour des projets personnels, des projets d'école et dans le cadre de mon alternance chez Sopra Steria"
        },
        "type":{
            "title": "Typescript",
            "theo":"",
            "pra":"Développement d'applications pour des projets personnels en Angular, utilisant le typeScript. Développement d'un composant 'treeview' uniquement en Typescript dans le cadre de mon alternance à Sopra Steria "
        },
        "angu":{
            "title":"Angular",
            "theo":"Tutoriel Angular 'Tour of heroes'. Lecture de nombreux articles et tutoriel sur le sujet.",
            "pra":"Développement d'applications pour des projets personnels, scolaires et pour une maquette d'application pour Sopra Steria. Développement de mon site de CV et de mon projet de site de recherche d'emploi."
        },
        "react":{
            "title":"React",
            "theo":"Lecture de livres sur Packt(React and react native, Beginning react, React Components)",
            "pra":""
        },
        "djan":{
            "title":"Django",
            "theo":"Tutoriel Django.",
            "pra":"Développement d'une application web python et django pour le projet final de l'option informatique de deuxième année."
        },
        "jq":{
            "title":"jQuery",
            "pra":"Utilisation dans de nombreux développements personnels, scolaires ou professionnels.",
            "theo":""
        },
        "node":{
            "title" :"Nodejs",
            "theo":"Tutoriel sur la page Youtube de TheNetNinja. Lecture de livres sur le site Packt (Node.js Essentials, Learn Node.js by building 6 projects, Node.js Web Development Fourth Edition) ",
            "pra":"Développement d'applications en back Node.js, dont mon projet d'application de recherche de premier emploi."
        },
        "csharp":{
            "title":"C#",
            "theo":"Nombreux tutoriels sur OpenClassroom (Apprenez à developper en c#, Apprenez ASP.net MVC Programmez orienté objet avec c#, Apprenez à programmer en C# sur.Net, Creez votre première application connectée en c#/.net), sur Pluralsight (ASP.NET MVC 5 Fundamentals). Lecture du livre Pro ASP.NET MVC 5 de Adam Freeman.",
            "pra":"Toutes les applications du pôle dans laquel je travaille, sont développées avec un back C# ASP.NET MVC"
        },
        "java":{
            "title":"Java",
            "theo":"Cours de Centrale Marseille pour l'option Java et l'option développement FullStack et Mobile. Lecture de livres sur Packt (Java Fundamentals, Java 9 Programming By Example)",
            "pra":""
        },
        "sql":{
            "title": "SQL",
            "pra":"Utilisation de Oracle SQL Developer pour toutes les applications du pôle .NET à Sopra Steria (création de base de donnée, écriture de scripts et de procédures stockées)",
            "theo":""
        },
        "elk":{
            "title":"Elasticsearch + Logstash + Kibana",
            "theo":"Lecture de la documentation complète des logiciels. Ecriture d'une documentaion pour l'installation et l'utilisation.",
            "pra":"Mission pour Sopra Steria consistant en l'étude de la suite de logiciel en vue d'une mise en oeuvre dans les projets de l'équipe. Etude complète de l'élaboration de groks afin de traiter des fichiers de log. Création de projets Angular utilisant un service Elasticsearch."
        },
        "ia":{
            "title":"Intelligence artificielle et machine learning",
            "theo":"Cours à Centrale Marseille en deuxième et troisième année.",
            "pra":"Résolutions de problèmes de jeux d'échec et d'awale."
        },
        "python":{
            "title":"Python",
            "pra": "",
            "theo" : "Cours et réalisation de nombreux travaux dans divers domaines au cours de mes études entre la première année de classe préparatoire et ma dernière année à Centrale Marseille."
        },
        "matlab":{
            "title": "Matlab",
            "theo":"",
            "pra":"Cours à Centrale Marseille, utilisation dans plusieurs matières et élaboration d'un projet final pour la matière Ondes et Signal."
        },
        "agile":{
            "title":"Développement agile",
            "theo":"Cours à Centrale Marseille. Etude du manifeste agile en vue d'une présentation à mes collègues de Sopra Steria.",
            "pra":""
        },
        "projet":{
            "title": "Gestion de projet",
            "theo":"",
            "pra":"MOOC sur la gestion de projet. Mise en oeuvre au sein de mon équipe à la SNCF, à Sopra Steria ou lors de projets de groupe à Centrale Marseille."
        },
        "vba":{
            "title": "VBA",
            "theo":"Lecture de tutoriels sur OpenClassroom.", 
            "pra": "Code pour la SNCF permettant d'optimiser le traitement de fichiers Excel d'approvisionnement"
        },
        "adob":{
            "title":"Adobe Illustrator, Adobe Photoshop",
            "pra":"Création de bannières, affiches et logo pour mes associations.",
            "theo":""
        },
        "fr":{
            "title":"Français",
            "pra":"langue maternelle",
            "theo":""
        },
        "en":{
            "title":"Anglais",
            "pra":"Avancé, TOEIC 960",
            "theo":""
        },
        "es":{
            "title":"Espagnol",
            "pra":"Intermédiaire",
            "theo":""
        }
    },
    "proj":{
        "title":"Projets",
        "cv":{
            "title":"CV dynamique",
            "desc":"Dévelopememnt de mon site personnel permettant de présenter de façon dynamique mon CV, en utilisant le framework Angular. Hébergement sur le serveur fourni par mon école Centrale Marseille."
        },
        "job":{
            "title":"Trouver une première expérience pro",
            "desc":"Un site qui aide les jeunes à trouver l'entreprise de leur rêve pour une première expérience professionnelle, que ce soit pour un stage, une césure, une alternance ou un premier emploi, et selon différents critères. Le but est de faire correspondre au mieux les offres avec les candidats. Le site est codé avec Angular et NodeJs."
        },
        "treeview":{
            "title":"Un Treeview réutilisable",
            "desc":"Dans le cadre de mon travail à Sopra, j'ai développé un composant treeview en Typescript. Le but était de créer un composant facile d'utilisation, facilement modifiable au niveau de la vue et des données, facilement intégrable. Ce composant peut être facilement utilisé dans n'importe quel contexte."
        },
        "elastic":{
            "title":"Documentation de la suite Elastic",
            "desc":"J'ai travaillé sur l'écriture d'une documentation complète pour la suite Elastic. J'ai écris, grâce à mes expérimentations, une documentation pour installer facilement Elasticsearch, Logstash et Kibana. Ensuite, j'ai lu et résumé la totalité de la documentation d'Elasticsearch, en ajoutant des informations qui me paraissaient importantes. Enfin, j'ai créé un projet Angular doté d'un service Elasticsearch, disponible sur Github."
        }
    },
    "int":{
        "hover": "survoler pour voir plus",
        "title": "Centres d'intérêt",
        "photo":"Photographie argentique et reflex",
        "music": "Musique - piano et ukulele",
        "sport": "Sport - running, fitness",
        "cook": "Cuisine",
        "asso": "Engagement associatif",
        "film": "Cinéma et séries télé",
        "detail":{
            "title":"Mon engagement associatif en détail",
            "cheer":"L'association a pour but d'aider des personnes atteintes du cancer ou en rémission à réussir des projets. Pour cela, des évènements sont organisés afin de récolter des fonds, ou des projets et sorties avec les personnes en rémissions permettent de les aider à se distraire ou à faire évoluer un projet. J'étais la secrétaire de cette association en 2018, mais aussi la responsable des projets. Pendant mon mandat, j'ai participé à l'organisation de divers événements, comme la 'Course contre le Cancer', où chaque kilomètre parcouru permet de verser 1€ à une association, ou encore l'Opération Cupidon, où la vente de roses à la St Valentin permet de gagner de l'argent. J'ai organisé deux sorties pour les patients en rémission : une sortie voile et une sortie de vols de découvert en ULM.",
            "inter":"J'étais membre de l'équipe organisant le tournoi sportif Intercentrale qui rassemble les cinq écoles Centrale (Paris, Lille, Nantes, Lyon, Marseille) pour un week end de compétition sportive dans cinq sports de balle. ",
            "pho":"Echanges Phocéen est une association où les membres offrent un tutorat culturel aux jeunes issus de territoires de l'éducation prioritaire ou en situation de handicap pou rpromouvoir l'égalité des chances.J'étais en charge d'une classe de troisième."
        }
    } ,
    "cv":{
        "cv-button": "Mon CV",
        "cv-text": "Pour imprimer une version simplifiée de mon CV",
        "aboutme":{
            "title":"A propos de moi",
            "text":"Je suis une personne travailleuse, dynamique et ambitieuse avec une passion pour l'informatique. Je suis actuellement en troisième et dernière année d'école d'ingénieur généraliste."
        },
        "project":{
            "title": "Projets",
            "resume":{
                "title":"Site de mon CV dynamique",
                "text":"Mon site personnel, où il est possible de trouver mon CV en version dynamique et dans une version plus classique."
            },
            "job":{
                "title":"Site de recherche de première expérience professionnelle",
                "text":"Un site qui aide les jeunes à trouver l'entreprise de leur rêve pour une première expérience professionnelle, que ce soit pour un stage, une césure, une alternance ou un premier emploi, et selon différents critères."
            }
        },
        "print":"Imprimer le CV",
        "load":"Télecharger le CV"
    },
    "skills":{
        "title":"Compétences"
    },
    "lang":{
        "title":"Langues",
        "fr":"Français - maternel",
        "en":"Anglais - avancé (TOEIC : 960)",
        "es":"Espagnol - intermédiaire"
    }
}